Documents/бит_ВводНачальныхОстатковПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ВводНачальныхОстатковПоКУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийВводНачальныхОстатковПоКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНаЛС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПолучателиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПолучателиДенежныхСредств</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолучательДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/бит_ВидыОперацийВводНачальныхОстатковПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийВводНачальныхОстатковПоКУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводИнтегральногоНачальногоСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДифференциальногоНачальногоСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводНачальныхОстатковПоПериоду</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ВводНачальныхОстатковПоКУ/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

#КонецОбласти

#Область УправлениеВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	// БИТ_ЖКХ 29.09.2016 16:39:20 Начало правки... 
	//Элементы.СписокЛСУслуга.Видимость = Объект.ВидОперации = Перечисления.бит_ВидыОперацийВводНачальныхОстатковПоКУ.ВводДифференциальногоНачальногоСальдо;	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийВводНачальныхОстатковПоКУ.ВводДифференциальногоНачальногоСальдо Тогда
		Элементы.СписокЛСУслуга.Видимость = Истина;	
		Элементы.ПредставлениеПериода.Видимость		  = Ложь;	
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидыОперацийВводНачальныхОстатковПоКУ.ВводНачальныхОстатковПоПериоду Тогда
		Элементы.СписокЛСУслуга.Видимость = Истина;	
		Элементы.ПредставлениеПериода.Видимость		  = Истина;
	Иначе
		Элементы.СписокЛСУслуга.Видимость = Ложь;	
		Элементы.ПредставлениеПериода.Видимость		  = Ложь;	
	КонецЕсли;
	// БИТ_ЖКХ 29.09.2016 16:39:21 Конец правки. 
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 23.09.2014
	ДокументОбъет = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.бит_ВводНачальныхОстатковПоКУ"));
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ДокументОбъет, Отказ);
	// БИТ_ЖКХ 23.09.2014
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
	// БИТ_ЖКХ 12.10.2016 16:42:04 Начало правки...
	ПредставлениеПериода = Формат(Объект.Период, "ДФ='ММММ гггг'");
	// БИТ_ЖКХ 12.10.2016 16:42:04 Конец правки.
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьДанныеКолонкиАдрес();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДанныеКолонкиАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	ОбновитьДанныеКолонкиАдрес();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
	ПараметрыФормы.Вставить("Дата"              , КонецДня(Объект.Дата));
	ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
	
	ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма.ФормаУправляемая", ПараметрыФормы, Элементы.СписокЛС);
	
КонецПроцедуры

// БИТ_ЖКХ 28.09.2016 16:26:57 Начало правки... 
&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если ЗначениеЗаполнено(Объект.Период)
		И ЗначениеЗаполнено(Объект.Организация) Тогда
		РассчитатьНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере()
	
	Запрос = Новый Запрос;
	
	МассивЛС = Объект.СписокЛС.Выгрузить(,"ЛицевойСчет").ВыгрузитьКолонку("ЛицевойСчет");
	Запрос.УстановитьПараметр("ЛицевыеСчета", МассивЛС);
	Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Период));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств КАК ПолучательДенежныхСредств,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры
	|ПОМЕСТИТЬ ПоставщикиИУслуги
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода {(&КонецПериода)},
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ЛицевыеСчета.Ссылка
	|				ИЗ
	|					Справочник.бит_ЛицевыеСчета КАК ЛицевыеСчета
	|				ГДЕ
	|					ЛицевыеСчета.Организация = &Организация
	|					" + ?(МассивЛС.Количество() > 0, "И ЛицевыеСчета.Ссылка В (&ЛицевыеСчета)", "") + ")) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
	|			И бит_СведенияПоУслугамЛССрезПоследних.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(
	|			,
	|			&КонецПериода,
	|			,
	|			,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ПоставщикиИУслуги.ЛицевойСчет,
	|					ПоставщикиИУслуги.Услуга
	|				ИЗ
	|					ПоставщикиИУслуги)) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоставщикиИУслуги.ЛицевойСчет КАК ЛицевойСчет,
	|	ПоставщикиИУслуги.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0) < 0
	|			ТОГДА -ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаКонечныйОстатокКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0) >= 0
	|			ТОГДА ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаКонечныйОстатокДт,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Квартира,
	|	бит_СписокЗданий.Корпус
	|ИЗ
	|	ПоставщикиИУслуги КАК ПоставщикиИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК Остатки
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = Остатки.ЛицевойСчет
	|			И ПоставщикиИУслуги.Услуга = Остатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|			ПО бит_ЛицевыеСчета.Здание = бит_СписокЗданий.Ссылка
	|		ПО ПоставщикиИУслуги.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
	|ГДЕ
	|	 ЕСТЬNULL(Остатки.СуммаКонечныйОстаток, 0) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоставщикиИУслуги.ЛицевойСчет,
	|	ПоставщикиИУслуги.Услуга.Приоритет";
	
	 Объект.СписокЛС.Очистить();
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 НоваяСтрока                 = Объект.СписокЛС.Добавить();
		 НоваяСтрока.ЛицевойСчет     = Выборка.ЛицевойСчет;
		 НоваяСтрока.Услуга			 = Выборка.Услуга;
		 НоваяСтрока.ШаблонИзвещений = ПолучитьШаблонИзвещений();
		 НоваяСтрока.Адрес           = Строка(Выборка.УлицаЛицевогоСчета)+", д. "+Строка(Выборка.Здание)+?(ПустаяСтрока(Выборка.Корпус),"",", кор. "+Выборка.Корпус)+", кв. "+Строка(Выборка.Квартира);
		 Если Выборка.СуммаКонечныйОстатокДт > 0 Тогда
			 НоваяСтрока.Сумма = Выборка.СуммаКонечныйОстатокДт;
		 ИначеЕсли Выборка.СуммаКонечныйОстатокКт > 0 Тогда
			 НоваяСтрока.Сумма = -Выборка.СуммаКонечныйОстатокКт;
		 Иначе
			Продолжить;	 
		 КонецЕсли;
	 КонецЦикла; 
	
КонецПроцедуры
// БИТ_ЖКХ 28.09.2016 16:27:00 Конец правки. 

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Обработчик события "ПриИзменении" поля "ЛицевойСчет" в табличном поле "СписокЛС".
&НаКлиенте
Процедура СписокЛСЛицевойСчетПриИзменении(Элемент)
	
	ТекДанные       = Элементы.СписокЛС.ТекущиеДанные;
	
	// БИТ_ЖКХ 03.04.2014
	Если  ТекДанные <> Неопределено Тогда
		ЛицевойСчет     = ТекДанные.ЛицевойСчет;
		СальдоНаЛС      = ПолучитьСальдоНаЛицевомСчете(ЛицевойСчет);
		// БИТ_ЖКХ 24.03.2014
		УлицаЛицевогоСчета = УлицаЛицевогоСчетаНаСервере(ТекДанные.ЛицевойСчет);
		Здание = ЗданиеНаСервере(ТекДанные.ЛицевойСчет);
		Корпус = КорпусНаСервере(ТекДанные.ЛицевойСчет);
		Квартира = КвартираНаСервере(ТекДанные.ЛицевойСчет);
		// БИТ_ЖКХ 24.03.2014
		ТекДанные.Адрес = Строка(УлицаЛицевогоСчета)+", д. "+Строка(Здание)+?(ПустаяСтрока(Корпус),"",", кор. "+Корпус+", кв. "+Квартира);
		ТекДанные.СальдоНаЛС = СальдоНаЛС;	
		ТекДанные.ШаблонИзвещений = ПолучитьШаблонИзвещений();
	КонецЕсли;
	// БИТ_ЖКХ 03.04.2014
	
КонецПроцедуры

// БИТ_ЖКХ 24.03.2014
&НаСервере
Функция УлицаЛицевогоСчетаНаСервере(ЛицевойСчет)
	
	Возврат ЛицевойСчет.УлицаЛицевогоСчета;	
	
КонецФункции	

&НаСервере
Функция ЗданиеНаСервере(ЛицевойСчет)
	
	Возврат ЛицевойСчет.Здание;	
	
КонецФункции	

&НаСервере
Функция КорпусНаСервере(ЛицевойСчет)
	
	Возврат ЛицевойСчет.Здание.Корпус;	
	
КонецФункции	

&НаСервере
Функция КвартираНаСервере(ЛицевойСчет)
	
	Возврат ЛицевойСчет.Квартира;	
	
КонецФункции	
// БИТ_ЖКХ 24.03.2014	

&НаКлиенте
Процедура СписокЛСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// БИТ_ЖКХ 03.04.2014
	ТаблицаЛСНаСервере(ВыбранноеЗначение);
	// БИТ_ЖКХ 03.04.2014
КонецПроцедуры

// БИТ_ЖКХ 03.04.2014
&НаСервере
Процедура ТаблицаЛСНаСервере(ВыбранноеЗначение)
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресЛСВХранилище);
	
	Если ТаблицаЛС = Неопределено Тогда
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить("Ошибка получения данных из временного хранилища. Выполните подбор заново.", СтатусСообщения.ОченьВажное);.
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка получения данных из временного хранилища. Выполните подбор заново.";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
		Возврат;
		
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из ТаблицаЛС Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", СтрокаТаблицы.ЛицевойСчет);
		
		СтрокиПоиска = Объект.СписокЛС.НайтиСтроки(Отбор);
		
		Отбор1 = Новый Структура;
		Отбор1.Вставить("ЛицевойСчет", СтрокаТаблицы.ЛицевойСчет);
		Отбор1.Вставить("Услуга"	 , СтрокаТаблицы.Услуга);
		
		СтрокиПоиска1 = Объект.СписокЛС.НайтиСтроки(Отбор1);
		
		
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийВводНачальныхОстатковПоКУ.ВводИнтегральногоНачальногоСальдо") Тогда				
			
			Если СтрокиПоиска.Количество() = 0 Тогда
				
				НоваяСтрока                 = Объект.СписокЛС.Добавить();
				НоваяСтрока.ЛицевойСчет     = СтрокаТаблицы.ЛицевойСчет;
				
				НоваяСтрока.ШаблонИзвещений = ПолучитьШаблонИзвещений();
				НоваяСтрока.Адрес           = Строка(СтрокаТаблицы.ЛицевойСчет.УлицаЛицевогоСчета)+", д. "+Строка(СтрокаТаблицы.ЛицевойСчет.Здание)+?(ПустаяСтрока(СтрокаТаблицы.ЛицевойСчет.Здание.Корпус),"",", кор. "+СтрокаТаблицы.ЛицевойСчет.Здание.Корпус)+", кв. "+Строка(СтрокаТаблицы.ЛицевойСчет.Квартира);
			КонецЕсли; 	
			
		ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийВводНачальныхОстатковПоКУ.ВводДифференциальногоНачальногоСальдо") Тогда				
			
			Если СтрокиПоиска1.Количество() = 0 Тогда
				
				НоваяСтрока                 = Объект.СписокЛС.Добавить();
				НоваяСтрока.ЛицевойСчет     = СтрокаТаблицы.ЛицевойСчет;
				
				// БИТ_ЖКХ 27.02.2014			
				НоваяСтрока.Услуга     = СтрокаТаблицы.Услуга;
				// БИТ_ЖКХ 27.02.2014			
				
				НоваяСтрока.ШаблонИзвещений = ПолучитьШаблонИзвещений();
				НоваяСтрока.Адрес           = Строка(СтрокаТаблицы.ЛицевойСчет.УлицаЛицевогоСчета)+", д. "+Строка(СтрокаТаблицы.ЛицевойСчет.Здание)+?(ПустаяСтрока(СтрокаТаблицы.ЛицевойСчет.Здание.Корпус),"",", кор. "+СтрокаТаблицы.ЛицевойСчет.Здание.Корпус)+", кв. "+Строка(СтрокаТаблицы.ЛицевойСчет.Квартира);
			КонецЕсли;	
		// БИТ_ЖКХ 29.09.2016 16:17:49 Начало правки... 	
		ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийВводНачальныхОстатковПоКУ.ВводНачальныхОстатковПоПериоду") Тогда				
			
			Если СтрокиПоиска1.Количество() = 0 Тогда
				
				НоваяСтрока                 = Объект.СписокЛС.Добавить();
				НоваяСтрока.ЛицевойСчет     = СтрокаТаблицы.ЛицевойСчет;
				НоваяСтрока.Услуга			= СтрокаТаблицы.Услуга;
				НоваяСтрока.ШаблонИзвещений = ПолучитьШаблонИзвещений();
				НоваяСтрока.Адрес           = Строка(СтрокаТаблицы.ЛицевойСчет.УлицаЛицевогоСчета)+", д. "+Строка(СтрокаТаблицы.ЛицевойСчет.Здание)+?(ПустаяСтрока(СтрокаТаблицы.ЛицевойСчет.Здание.Корпус),"",", кор. "+СтрокаТаблицы.ЛицевойСчет.Здание.Корпус)+", кв. "+Строка(СтрокаТаблицы.ЛицевойСчет.Квартира);
			КонецЕсли;
		// БИТ_ЖКХ 29.09.2016 16:17:52 Конец правки. 	
			
		КонецЕсли; 
		
	КонецЦикла; 	
КонецПроцедуры	
// БИТ_ЖКХ 03.04.2014	

&НаКлиенте
Процедура СписокЛСЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация"      , Объект.Организация);
	// БИТ_ЖКХ 23.08.2016 12:06:39 Начало правки... 
	//Отбор.Вставить("НеВестиРасчетПени", Ложь);
	// БИТ_ЖКХ 23.08.2016 12:06:41 Конец правки. 
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.СписокЛС.ТекущиеДанные;
	
	ЛицевойСчет = ТекСтрока.ЛицевойСчет;
	
	СписокЗнУслуг = ПолучитьСписокЗначенийУслуг(ЛицевойСчет);
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка",СписокЗнУслуг);
	
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор",Отбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	ЛицевойСчет = ТекСтрока.ЛицевойСчет;
	
	УдалитьСтрокиСпискаУслуг(ЛицевойСчет);
	
КонецПроцедуры

// Служебная функция получения значения реквизита объекта (выполняется на сервере).
&НаСервере
Функция ПолучитьШаблонИзвещений()
	
	Возврат Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	
КонецФункции

// Служебная процедура для заполнения колонки "Адрес" табличного поля "СписокЛС".
&НаСервере
Процедура ОбновитьДанныеКолонкиАдрес()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК Корпус,
	|	бит_ЛицевыеСчета.Квартира
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка В(&СписокЛицевыхСчетов)"
	);
	
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов",Объект.СписокЛС.Выгрузить().ВыгрузитьКолонку("ЛицевойСчет"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Стр Из Объект.СписокЛС Цикл
		
		Если Выборка.НайтиСледующий(Стр.ЛицевойСчет,"ЛицевойСчет") Тогда
			
			Стр.Адрес = Строка(Выборка.УлицаЛицевогоСчета) + ", д. " + Строка(Выборка.Здание) + ?(ПустаяСтрока(Выборка.Корпус),"",", кор. " + Строка(Выборка.Корпус)) + ", кв. " + Строка(Выборка.Квартира);
			
		Иначе
			
			Стр.Адрес = "";
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗначенийУслуг(ЛицевойСчет)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);   
	Запрос.УстановитьПараметр("Момент"     ,Объект.Дата);
	
	СписокЗнУслуг = Новый СписокЗначений;
	СписокЗнУслуг.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Услуга"));
	
	Возврат СписокЗнУслуг;
	
КонецФункции

&НаСервере
Функция ПолучитьСальдоНаЛицевомСчете(ЛицевойСчет)
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацийВводНачальныхОстатковПоКУ.ВводИнтегральногоНачальногоСальдо Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстатки";
		
		Запрос.УстановитьПараметр("Момент"     ,Объект.Дата);
		Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			СальдоНаЛС = Выборка.Остаток;
			
		КонецЕсли;
		
	Иначе
		
		СальдоНаЛС = 0;
		
	КонецЕсли;
	
	Возврат СальдоНаЛС;
	
КонецФункции

&НаСервере
Процедура УдалитьСтрокиСпискаУслуг(ЛицевойСчет)
	
	НайденныеСтроки = Объект.СписокУслуг.НайтиСтроки(Новый Структура("ЛицевойСчет",ЛицевойСчет));
	
	Для Каждого ТекСтрокаМассива Из НайденныеСтроки Цикл
		
		Объект.СписокУслуг.Удалить(ТекСтрокаМассива);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"         , Объект.Организация);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.СписокЛС.Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОрганизацияПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.СписокЛС.Очистить();
	Объект.СписокУслуг.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Проведен Тогда
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить("Перед изменением таблицы лицевых счетов - распроведите документ", СтатусСообщения.Информация);.
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
		СтандартнаяОбработка = Ложь;
		
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

// БИТ_ЖКХ 12.10.2016 16:33:52 Начало правки... 
&НаКлиенте
Процедура ПредставлениеПериодаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	// Обновляем представление периода на форме.
	ПредставлениеПериода = бит_ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
										ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"),
										НачалоМесяца(Объект.Период), 
										КонецМесяца(Объект.Период));
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ПредставлениеПериода) Тогда
		ПредставлениеПериода = Формат(Объект.Период, "ДФ='ММММ гггг'");
	КонецЕсли;
	
	ПредставлениеПериода = бит_ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), 
	НачалоМесяца(Объект.Период), 
	КонецМесяца(Объект.Период));

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		Объект.Период = КонецМесяца(ТекущаяДата()) - 1;
	КонецЕсли;
	ПараметрыВыбораМесяца = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(Объект.Период), КонецМесяца(Объект.Период));
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбораМесяца, Элементы.ПредставлениеПериода, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.Период = КонецМесяца(РезультатВыбора.КонецПериода) - 1;
	
	ПриИзмененииПериода();
	
КонецПроцедуры

// БИТ ЖКХ 31.07.2020
&НаКлиенте
Процедура ЗаполнитьВсеЛС(Команда)
	
 ЗаполнитьВсеЛСНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеЛСНаСервере()
	
	ТекущиеЛС = новый массив;
	для каждого стр из Объект.СписокЛС цикл
	  ТекущиеЛС.Добавить(стр.ЛицевойСчет);	
    конеццикла;	
  
    запрос = новый Запрос;
	запрос.Текст =    "ВЫБРАТЬ
	                  |	бит_ЛицевыеСчета.Ссылка КАК Ссылка,
	                  |	бит_ЛицевыеСчета.ПометкаУдаления КАК ПометкаУдаления
	                  |ИЗ
	                  |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	                  |ГДЕ
	                  |	бит_ЛицевыеСчета.ПометкаУдаления = &ПометкаУдаления";
	
	запрос.УстановитьПараметр("ПометкаУдаления", ложь);
	
	таблицаЛС = запрос.Выполнить().Выгрузить();
	
	для каждого стр из таблицаЛС цикл
		
		если ТекущиеЛС.Найти(стр.Ссылка) = неопределено тогда
			НоваяСтрока = Объект.СписокЛС.Добавить();
			НоваяСтрока.ЛицевойСчет = стр.Ссылка;
		конецесли;	
		
	конеццикла;
	
КонецПроцедуры


#КонецОбласти
